# Data Loading, Storage, and File Formats

## Reading and Writing Data in Text Format

 Table 6-1. Parsing functions in pandas
 Function            Description
 read_csv            Load delimited data from a file, URL, or file-like object; use comma as default delimiter
 read_table          Load delimited data from a file, URL, or file-like object; use tab ('\t') as default delimiter
 read_fwf            Read data in fixed-width column format (i.e., no delimiters)
 read_clipboard      Version of read_table that reads data from the clipboard; useful for converting tables from web pages
 read_excel          Read tabular data from an Excel XLS or XLSX file
 read_hdf            Read HDF5 files written by pandas
 read_html           Read all tables found in the given HTML document
 read_json           Read data from a JSON (JavaScript Object Notation) string representation
 read_msgpack        Read pandas data encoded using the MessagePack binary format
 read_pickle         Read an arbitrary object stored in Python pickle format
 read_sas            Read a SAS dataset stored in one of the SAS system’s custom storage formats
 read_sql            Read the results of a SQL query (using SQLAlchemy) as a pandas DataFrame
 read_stata          Read a dataset from Stata file format
 read_feather        Read the Feather binary file format

In [17]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [12]:
pd.read_csv('ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
names = ['a','b','c','d','message']

In [14]:
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [15]:
parsed = pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])

In [17]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [22]:
list(open('ex3.txt'))

['  A B C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [23]:
result= pd.read_table('ex3.txt',sep= '\s+')

In [24]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [27]:
pd.read_csv('ex4.csv', skiprows=[0,2,3])

    a   b   c   d message
0   1   2   3   4   hello
1   5   6   7   8   world
2   9  10  11  12     foo

In [28]:
result = pd.read_csv('ex5.csv')

In [29]:
result

   something  a   b     c   d message
0        one  1   2   3.0   4     NaN
1        two  5   6   NaN   8   world
2      three  9  10  11.0  12     foo

In [30]:
pd.isnull(result)

    something      a      b      c      d  message
0       False  False  False  False  False     True
1       False  False  False   True  False    False
2       False  False  False  False  False    False

In [34]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [35]:
result

   something  a   b     c   d message
0        one  1   2   3.0   4     NaN
1        two  5   6   NaN   8   world
2      three  9  10  11.0  12     foo

In [36]:
sentinels = {'message': ['foo','NA'],'something':['two']}

In [37]:
pd.read_csv('ex5.csv', na_values=sentinels)

   something  a   b     c   d message
0        one  1   2   3.0   4     NaN
1        two  5   6   NaN   8   world
2      three  9  10  11.0  12     NaN

Table 6-2. Some read_csv/read_table function arguments
 Argument            Description
 path                String indicating filesystem location, URL, or file-like object
 sep or delimiter    Character sequence or regular expression to use to split fields in each row
 header              Row number to use as column names; defaults to 0 (first row), but should be None if there is no
                      header row
 index_col           Column numbers or names to use as the row index in the result; can be a single name/number or a
                      list of them for a hierarchical index
 names               List of column names for result, combine with header=None
 skiprows            Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip.
 na_values           Sequence of values to replace with NA
 comment             Character(s) to split comments off the end of lines.
 parse_dates         Attempt to parse data to datetime; False by default. If True, will attempt to parse all columns.
                      Otherwise can specify a list of column numbers or name to parse. If element of list is tuple or list, will
                      combine multiple columns together and parse to date (e.g., if date/time split across two columns).
 keep_date_col       If joining columns to parse date, keep the joined columns; False by default.
 converters          Dict containing column number of name mapping to functions (e.g., {'foo': f} would apply the
                      function f to all values in the 'foo' column . 
 dayfirst            When parsing potentially ambiguous dates, treat as international format (e.g., 7/6/2012 -> June 7,
                      2012); False by default.
 date_parser         Function to use to parse dates
 nrows               Number of rows to read from beginning of file.
 iterator            Return a TextParser object for reading file piecemeal.
 chunksize           For iteration, size of file chunks
 skip_footer         Number of lines to ignore at end of file.
 verbose             Print various parser output information, like the number of missing values placed in non-numeric
                      columns.
 encoding            Text encoding for Unicode (e.g., 'utf-8' for UTF-8 encoded text).
 squeeze             If the parsed data only contains one column, return a Series.
 thousands           Separator for thousands (e.g., ',' or '.').

### Reading Text Files in Pieces

In [38]:
pd.options.display.max_rows = 10

In [42]:
import pandas as pd
import numpy as np

# Set random seed for reproducibility
np.random.seed(42)

# Generate the data
data = []
for i in range(10000):
    row = [
        i,
        np.random.normal(0, 1),
        np.random.normal(0, 1),
        np.random.normal(0, 1),
        np.random.normal(0, 1),
        np.random.choice(list('ABCDEFGHIJKLMNOPQRSTUVWXYZ'))
    ]
    data.append(row)

# Create DataFrame
columns = ['', 'one', 'two', 'three', 'four', 'key']
df = pd.DataFrame(data, columns=columns)

# Save to CSV
df.to_csv('ex6.csv', index=False, float_format='%.6f')

print("File 'ex6.csv' created with 10000 rows!")

File 'ex6.csv' created with 10000 rows!

In [43]:
result = pd.read_csv('ex6.csv')

In [44]:
result

      Unnamed: 0       one       two     three      four key
0              0  0.496714 -0.138264  0.647689  1.523030   G
1              1 -0.916827 -0.124147 -2.010963 -0.492803   H
2              2 -0.580878 -0.525170 -0.571380 -0.924083   V
3              3 -2.439106  0.603441 -0.251044 -0.163867   S
4              4  0.142465 -0.034652  1.134339 -0.104746   G
...          ...       ...       ...       ...       ...  ..
9995        9995 -0.393108 -1.123158 -0.079028 -0.779463   U
9996        9996  0.265026 -1.227806  0.268761  1.344134   H
9997        9997 -0.203000 -0.407957 -0.709026  0.331596   J
9998        9998 -1.595832 -0.560294  0.451260  1.157619   J
9999        9999  1.152477 -1.143212 -0.536287 -0.804794   D

[10000 rows x 6 columns]

In [47]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)

In [48]:
chunker

In [49]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)

tot= pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [50]:
tot[:10]

key
V    426
U    416
O    413
R    411
M    411
S    410
Q    395
W    392
D    392
C    390
dtype: object

### Writing Data to Text Format

In [3]:
data = pd.read_csv('ex5.csv')

In [4]:
data

   something  a   b     c   d message
0        one  1   2   3.0   4     NaN
1        two  5   6   NaN   8   world
2      three  9  10  11.0  12     foo

In [6]:
data.to_csv('out.csv')

In [7]:
!type out.csv

, something,a,b,c,d,message
0, one,1,2,3.0,4,
1, two,5,6,,8,world
2, three,9,10,11.0,12,foo

In [8]:
import sys   #writing to sys.stdout so it print the text result to the console.

In [9]:
data.to_csv(sys.stdout, sep='|')

| something|a|b|c|d|message
0| one|1|2|3.0|4|
1| two|5|6||8|world
2| three|9|10|11.0|12|foo

In [11]:
#if missing values in appear as empty string you might want to denote by some other sentimental values.
data.to_csv(sys.stdout, na_rep='NULL')

, something,a,b,c,d,message
0, one,1,2,3.0,4,NULL
1, two,5,6,NULL,8,world
2, three,9,10,11.0,12,foo

In [13]:
data.to_csv(sys.stdout, index=False, header=False)

 one,1,2,3.0,4,
 two,5,6,,8,world
 three,9,10,11.0,12,foo

In [14]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [15]:
dates = pd.date_range('1/1/2000', periods=7)

In [18]:
ts = pd.Series(np.arange(7), index=dates)

In [19]:
ts.to_csv('tseries.csv')

In [20]:
!type tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### Working with Delimited Formats

In [22]:
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [23]:
import csv
f = open('ex7.csv')
reader = csv.reader(f)

In [24]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [25]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [26]:
header, values = lines[0], lines[1:]

In [27]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [28]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [36]:
class my_dialect(csv.Dialect):
    
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
    
 reader = csv.reader(f, dialect=my_dialect)

IndentationError: unindent does not match any outer indentation level (<string>, line 8)

In [37]:
reader = csv.reader(f, delimiter='|')

ValueError: I/O operation on closed file.

 Table 6-3. CSV dialect options
 Argument               Description
 delimiter              One-character string to separate fields; defaults to ','.
 lineterminator         Line terminator for writing; defaults to '\r\n'. Reader ignores this and recognizes cross-platform line terminators.
 quotechar              Quote character for fields with special characters (like a delimiter); default is '"'
 quoting                Quoting convention. Options include csv.QUOTE_ALL (quote all fields), csv.QUOTE_MINI MAL (only fields with special                             characters like the delimiter), csv.QUOTE_NONNUMERIC, and csv.QUOTE_NONE (no quoting). See Python’s documentation                              for full details. Defaults to QUOTE_MINIMAL.
 skipinitialspace        Ignore whitespace after each delimiter; default is False.
 doublequote             How to handle quoting character inside a field; if True, it is doubled (see online documentation
                          for full detail and behavior).
 escapechar               String to escape the delimiter if quoting is set to csv.QUOTE_NONE; disabled by default

In [38]:
with open('mydata.csv','w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

### JSON Data

In [39]:
obj = """
 {"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
 }
 """

In [40]:
import json

In [41]:
result= json.loads(obj)

In [42]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [43]:
asjson = json.dumps(result)   # json.dumps, on the other hand, converts a Python object back to JSON:

In [44]:
siblings = pd.DataFrame(result['siblings'], columns=['name','age'])

In [45]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [47]:
!type example.json

 [{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [48]:
data = pd.read_json('example.json')

In [49]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [50]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [51]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML: Web Scraping

In [53]:
tables = pd.read_html('fdic_failed_bank_list.html')

In [54]:
len(tables)

1

In [57]:
failures = tables[0]

In [58]:
failures.head()

,Bank Name,"City, ST",CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,"Mulberry, AR",91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,"Woodbury, GA",11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,"King of Prussia, PA",35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,"Memphis, TN",9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,"Milwaukee, WI",20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [61]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [62]:
close_timestamps.dt.year.value_counts()

Closing Date
2016    5
Name: count, dtype: int64

### Parsing XML with lxml.objectify

In [74]:
 <INDICATOR>
  <INDICATOR_SEQ>373889</INDICATOR_SEQ>
  <PARENT_SEQ></PARENT_SEQ>
  <AGENCY_NAME>Metro-North Railroad</AGENCY_NAME>
  <INDICATOR_NAME>Escalator Availability</INDICATOR_NAME>
  <DESCRIPTION>Percent of the time that escalators are operational
   systemwide. The availability rate is based on physical observations performed
   the morning of regular business days only. This is a new indicator the agency
   began reporting in 2009.</DESCRIPTION>
  <PERIOD_YEAR>2011</PERIOD_YEAR>
  <PERIOD_MONTH>12</PERIOD_MONTH>
  <CATEGORY>Service Indicators</CATEGORY>
  <FREQUENCY>M</FREQUENCY>
  <DESIRED_CHANGE>U</DESIRED_CHANGE>
  <INDICATOR_UNIT>%</INDICATOR_UNIT>
  <DECIMAL_PLACES>1</DECIMAL_PLACES>
  <YTD_TARGET>97.00</YTD_TARGET>
  <YTD_ACTUAL></YTD_ACTUAL>
  <MONTHLY_TARGET>97.00</MONTHLY_TARGET>
  <MONTHLY_ACTUAL></MONTHLY_ACTUAL>
 </INDICATOR>

SyntaxError: invalid syntax (3854243452.py, line 1)

In [64]:
from lxml import objectify

In [65]:
path = 'Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [68]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

AttributeError: no such child: INDICATOR

In [75]:
perf = pd.DataFrame(data)

In [76]:
perf.head()

Empty DataFrame
Columns: []
Index: []

In [84]:
from io import StringIO
tag = '<a href="http://www,google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [85]:
root

In [86]:
root.get('href')

'http://www,google.com'

In [87]:
root.text

'Google'

## Binary Data Formats

In [88]:
frame = pd.read_csv('ex1.csv')

In [89]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [90]:
frame.to_pickle('frame_pickle')

In [91]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## Using HDF5 Format

In [92]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [93]:
store = pd.HDFStore('mydata.h5')

In [94]:
store['obj1'] = frame

In [95]:
store['obj1_col'] = frame

In [96]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [98]:
store['obj1']

           a
0  -0.606803
1   0.423628
2  -0.086118
3  -0.050050
4   1.046172
..       ...
95  0.478999
96 -1.598218
97  1.037821
98 -1.153406
99  1.227598

[100 rows x 1 columns]

In [99]:
store.put('obj2', frame, format='table')

In [102]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.839965
11  1.531948
12  1.255880
13  0.781302
14  1.602663
15 -0.150768

In [103]:
store.close()

In [104]:
frame.to_hdf('mydata.h5','obj3', format='table')

C:\Users\Hemant\AppData\Local\Temp\ipykernel_14184\3526991272.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_hdf except for the argument 'path_or_buf' will be keyword-only.
  frame.to_hdf('mydata.h5','obj3', format='table')

In [105]:
pd.read_hdf('mydata.h5', 'obj3', where = ['index<5'])

          a
0 -0.606803
1  0.423628
2 -0.086118
3 -0.050050
4  1.046172

## Reading Microsoft Excel Files

In [111]:
import pandas as pd

# Create the data
data = {
    'a': [1, 5, 9],
    'b': [2, 6, 10],
    'c': [3, 7, 11],
    'd': [4, 8, 12],
    'message': ['hello', 'world', 'foo']
}

# Create DataFrame
df = pd.DataFrame(data)

# Save to Excel file
df.to_excel('ex1.xlsx', index=False)

print("Excel file 'ex1.xlsx' created successfully!")

Excel file 'ex1.xlsx' created successfully!

In [112]:
xlsx = pd.ExcelFile('ex1.xlsx')

In [113]:
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [114]:
frame = pd.read_excel('ex1.xlsx','Sheet1')

In [115]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [116]:
writer = pd.ExcelWriter('ex2.xlsx')

In [120]:
frame.to_excel(writer, 'Sheet1')

C:\Users\Hemant\AppData\Local\Temp\ipykernel_14184\884453241.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  frame.to_excel(writer, 'Sheet1')

In [121]:
writer.save()

AttributeError: 'OpenpyxlWriter' object has no attribute 'save'

In [122]:
frame.to_excel('ex2.xlsx')

## Interacting with Web APIs

In [123]:
import requests

In [124]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [125]:
resp = requests.get(url)

In [127]:
resp

In [128]:
data = resp.json()

In [129]:
data[0]['title']

'TST: Replace ensure_clean with temp_file in test_file_store.py'

In [130]:
issue = pd.DataFrame(data, columns=['number', 'title', 'labels','state'])

In [131]:
issue

,number,title,labels,state
0,62896,TST: Replace ensure_clean with temp_file in te...,[],open
1,62895,TST: Every function ensure_clean in the file /...,[],open
2,62893,BUG: Fix DataFrame.from_dict empty row drop,[],open
3,62892,BUG: try triggering exceptions from custom met...,[],open
4,62891,DOC: Inline docstrings in pandas\core\generic....,[],open
5,62890,DOC: Enhance BooleanDtype docstring with detai...,[],open
6,62889,"BUG: concat([ints, bools]) incorrect casting",[],open
7,62888,BUG: factorize with objects differentiate 0/1 ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,62886,PERF: Shallow copy Series in timeseries plotting,"[{'id': 2413328, 'node_id': 'MDU6TGFiZWwyNDEzM...",open
9,62885,TST: Speed up slow tests,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
10,62884,[backport 2.3.x] BUG: use arrow backend for di...,[],open
11,62883,BUILD: arm32 cross compile issues,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
12,62882,"DOC: Replace @doc, @Appender, and @Substitutio...","[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
13,62880,BUG: for ordered categorical data implements c...,[],open
14,62873,"BUG: bdate_range with ""cbh"" fails","[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
15,62871,DEPR: automatic upcasting in reindex,[],open
16,62870,ENH: Double-double arithmetic for precision op...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
17,62868,TST: ensuring bins in cut during tiling are pr...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
18,62867,ENH: Improve error handling in Excel export fu...,[],open
19,62865,ENH: Improve Excel header formatting with CSS-...,[],open
20,62864,BUG: Wrong skewness and kurtosis in `Rolling.{...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,62863,BUG: fix polluted window in skewness computation,"[{'id': 1045950827, 'node_id': 'MDU6TGFiZWwxMD...",open
22,62862,ENH: Add autofilter support to Excel export,[],open
23,62861,[DOC] Improved docstring offset class BusinessDay,[],open
24,62860,STY: Enforce Ruff rule B905 for scripts/valida...,[],open
25,62859,DOC: remove gitpod/docker/devcontainer related...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
26,62858,DOC: removed @Appender and @Substition and rep...,[],open
27,62855,BUG: CSV Double Quotes,"[{'id': 47229171, 'node_id': 'MDU6TGFiZWw0NzIy...",open
28,62853,DOC: Clarify groupby operates on axis 0 and re...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
29,62852,STY: use strict zip in `pandas/tests/window`,[],open

## Interacting with Databases

In [132]:
import sqlite3

In [133]:
query ="""
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL, d INTEGER
 );"""

In [134]:
con = sqlite3.connect('mydata.sqlite')

In [136]:
con.execute(query)

In [137]:
con.commit()

In [138]:
data = [('Atlanta', 'Georgia', 1.25, 6),      
('Tallahassee', 'Florida', 2.6, 3),
('Sacramento', 'California', 1.7, 5)]

In [139]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [140]:
con.executemany(stmt, data)

In [141]:
con.commit()

In [142]:
cursor = con.execute('select * from test')

In [143]:
rows = cursor.fetchall()

In [144]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [145]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [146]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [147]:
import sqlalchemy as sqla

In [149]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [150]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5